{
  "header": {
    "title": "John Lin",
    "home": "Home",
    "posts": "Posts",
    "project": "Project",
    "setting": "Setting"
  },
  "footer": {
    "copyright": "All rights reserved."
  },
  "home": {
    "top-content": [
      "Hi! I'm John Lin",
      "Content is being prepared.",
      "Coming soon..."
    ],
    "who_am_i": {
      "title": "Hi! I am John Lin.",
      "p1": "New design is being prepared...",
      "personality": {
        "title": "Personality",
        "contents": [
          "I see myself as someone who follows their genuine feelings and values self-reflection. I often seek to understand the deeper essence of things and explore the connections between myself and the world around me. I tend to approach life from my own values and perspectives.",
          "Most of the time, I resonate with the INFP-A personality type. I have a sharp sense of observation that helps me understand others’ emotions and needs, and I hope to have a positive impact within my abilities. I believe that genuine connection comes from sincere interactions, and I’m always willing to support family and friends, helping each other grow.",
          "I prefer not to be limited by rigid rules and instead rely on my own motivation to create a life that feels authentic. When faced with challenges, I remain calm and seek practical solutions. To me, difficulties are opportunities for growth, and I believe that by approaching them with an open heart, I can ultimately break through any barriers.",
          "I also have a touch of perfectionism, particularly with projects I am deeply invested in, where I am meticulous about details. I enjoy infusing my work with personal touches and strive to have each design reflect my ideas and values."
        ]
      },
      "interest": {
        "title": "Interests",
        "contents": [
          "I’m passionate about design and development, especially web design. React.js is my go-to framework due to its flexibility, allowing me to bring various interface ideas to life. For me, design is not only about solving problems but also a form of expression. I aim to create work that conveys my appreciation for detail in a simple and elegant way.",
          "Beyond technical interests, I’m also drawn to reflecting on social phenomena, like personal beliefs, societal expectations, and the impact of education. I observe the people and events around me to gain a deeper understanding of the world, always searching for a lifestyle and values I truly resonate with."
        ]
      },
      "skills": {
        "title": "Skills",
        "contents": [
          "My main strengths lie in web and graphic design, especially in UI and presentation design. I’m particularly sensitive to the “breathing” and “harmony” of a design, and even without delving deeply into design theory, I naturally find balance within my layouts. When it comes to branding projects, I can tailor presentations, promotional posters, or visuals that truly embody the brand’s spirit, making sure they resonate with its unique essence."
        ]
      },
      "beliefs_and_values": {
        "title": "Beliefs and Values",
        "contents": [
          "I place a high value on a life guided by freedom and self-motivation. I believe life’s core is about doing what we genuinely love without restriction.",
          "Work, to me, should not be isolated from life but rather blend naturally with it, becoming a meaningful part of each day rather than a heavy obligation. This is why I am drawn to freelancing; it allows me the freedom to pursue my interests while feeling fulfilled.",
          "I also have strong views on love and family. I believe that the foundation of love and familial bonds is mutual understanding and trust. This kind of connection allows for unconditional support and mutual growth, becoming the most solid source of strength in my life. Love, in its purest form, is a bond between two souls, enabling them to uplift and support each other through any challenge.",
          "As for education, I have some reservations about the current system, especially in Taiwan. The rigid rules within the traditional educational model feel stifling to me, as I feel they suppress creativity and self-expression. I believe education should help children discover themselves, not merely fill them with knowledge. Education should not be like a factory that aims to make everyone the same, but rather a journey that helps each person find their own path."
        ]
      },
      "dreams": {
        "title": "Dreams",
        "contents": [
          "My dream is to live a life of true freedom, unbound by societal expectations or the constraints of time. I aspire to be a freelancer, turning my passions into my work so that work and life blend seamlessly. I want a life where I can create freely, continuously learning and growing across different fields without the pressure or constraints of a traditional career.",
          "Additionally, I hope to create a nurturing, imaginative, and creative environment for the next generation. I envision my children growing up in an educational system that encourages curiosity and imagination, where they can genuinely enjoy learning rather than feeling burdened by it. This dream goes beyond my personal goals; it’s a hope to transform education into a place of growth and self-fulfillment rather than a competitive battleground."
        ]
      }
    }
  },
  "project": {
    "title": "Project",
    "detail": {
      "": "",
      "author": "Author",
      "anonymous": "Anonymous",
      "startDate": "Start Date",
      "endDate": "End Date",
      "tags": "Tags",
      "Video Resolution": "Video Resolution",
      "Photo Resolution": "Photo Resolution",
      "Shooting Time": "Shooting Time",
      "Copyright": "Copyright",
      "Subject": "Subject",
      "Exam Time": "Exam Time",
      "createdAt": "Created At"
    },
    "projectNotFound": "Project Not Found"
  },
  "posts": {
    "title": "Posts",
    "content": "Content is being prepared..."
  },
  "settings": {
    "title": "Settings",
    "theme": {
      "title": "Theme",
      "light": "Light",
      "dark": "Dark"
    },
    "language": {
      "title": "Language",
      "en-US": "English",
      "zh-TW": "Chinese (Taiwan)"
    }
  },
  "imageViewer": {
    "zoomIn": "Zoom In",
    "zoomOut": "Zoom Out",
    "reset": "Reset"
  }
}
